cxandy/S3-Amysynth/sdkconfig.defaults
# ESP32-S3 Target
# CONFIG_IDF_TARGET="esp32s3"
# ESP PSRAM
#
CONFIG_SPIRAM=y
CONFIG_LIBC_PICOLIBC=y
#
# SPI RAM config
#
# CONFIG_SPIRAM_MODE_QUAD is not set
CONFIG_SPIRAM_MODE_OCT=y
# default:
CONFIG_SPIRAM_TYPE_AUTO=y
# flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
#
# USB Audio (UAC) task core affinity
#
# Pin the TinyUSB UAC tasks to Core 0 (was -1 / no affinity). This keeps the
# USB stack deterministically next to its ISR on Core 0 and away from the AMY
# DSP render task, which is pinned to Core 1.
CONFIG_UAC_TINYUSB_TASK_CORE=0
CONFIG_UAC_MIC_TASK_CORE=0
#
# TEMP DEBUG: comprehensive heap poisoning to catch heap corruption at its source
#
# CONFIG_HEAP_POISONING_COMPREHENSIVE=n
CONFIG_CU_GCC_LTO_ENABLE=y
#
# PERF (2026-06): double the ESP32-S3 instruction cache from 16KB to 32KB.
# Most AMY DSP code still executes from flash through this cache (only the
# hottest functions are pinned to IRAM via components/amy/amy_iram.lf), so a
# larger I-cache reduces miss-stalls on the render path. Costs 16KB of internal
# SRAM, which we have to spare. Keep the 8-way / 32B line settings.
#
# CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
# CONFIG_ESP32S3_INSTRUCTION_CACHE_8WAYS=y
# CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
#
# PERF (2026-06): flash QIO @ 80MHz. Was QOUT (quad-out, 2x slower address
# phase). The S3-WROOM-1 in-package quad flash supports QIO; FLASH_MODE_AUTO_DETECT
# is on, so if the chip ever rejects QIO the bootloader falls back loudly. Faster
# instruction fetch for all flash-resident (non-IRAM) code.
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
#
# RELIABILITY (2026-07): let the render-clock GPTimer ISR run while the flash
# cache is disabled (LittleFS project I/O, NVS). Without it the alarm interrupt
# is masked for the whole cache-off window: pending alarms collapse to one
# delivery, so the render/sequencer clock silently loses time and the stall is
# invisible to the overrun counter. With it, ticks keep arriving and a stall
# surfaces honestly as counted render_overruns. Safe here: the handler is
# IRAM_ATTR, GPTIMER_OBJ_CACHE_SAFE=y keeps driver state in DRAM, and
# vTaskNotifyGiveFromISR stays in IRAM (FREERTOS_PLACE_ISR_FUNCTIONS_INTO_FLASH
# is off).
#
CONFIG_GPTIMER_ISR_CACHE_SAFE=y